//首页基础数据
const result={
  "data": {
    "place": "北京",//地点
    "dailyRegistNum": 100,//当日新增销售员注册数
    "totalRegistNum": 10000,//总数
    "dailySalesMoney": 2000,//当日销售额
    "onlineUserNum": 100,//当前在线销售员数
    "dailyTotalShareNum": 500//当日分享总数
  },
  "message": "成功",
  "errorCode": 0
}

//首页曲线
const result1={
  "data": {
    "place": "北京",//地点
    "type": "week",//week：周数据 day：日数据
    "weekX":['09/01','09/08','09/15','09/22','09/27','10/4','10/11','10/18','10/25','11/01','11/08','11/15','11/22','11/29','12/06'],//分销员在线数的x轴：周
    "dayX": ['09/01','09/02','09/03','09/04','09/05','09/06','09/07','09/08','09/09','09/10','09/11','09/12','09/13','09/14','09/15'],//分销员在线数的x轴：日
    "onlineY": [231,234,52,21,123,452,342,223,72,196,146,231,126,94,132],//分销员在线数
    "shareY": [321,423,344,745,624,643,544,455,964,689,369,975,567,678],//分销员分享数
  },
  "message": "成功",
  "errorCode": 0
}

//首页柱状图
const result2={
  "data": {
    "place": "北京",//地点
    "type": "week",//week：周数据 day：日数据
    "X":['09/01','09/08','09/15','09/22','09/27','10/4','10/11','10/18','10/25','11/01','11/08','11/15','11/22','11/29','12/06'],//销售金额的x轴：周
    "X": ['09/01','09/02','09/03','09/04','09/05','09/06','09/07','09/08','09/09','09/10','09/11','09/12','09/13','09/14','09/15'],//销售金额的x轴：日
    "salesY": [231,234,52,21,123,452,342,223,72,196,146,231,126,94,132],//对应日或者周的销售金额的值
    "totalSalesY": [321,423,344,745,624,643,544,455,964,689,369,975,567,678],//对应日或者周的总销售金额的值
  },
  "message": "成功",
  "errorCode": 0
}

module.exports={
  result:result,
  result1:result1,
  result2:result2
}
